[{"Item":0,"Better":"The halftime show at the football match was organised by the alcoholic.","Worse":"The halftime show at the football match was organised by the rum."},{"Item":1,"Better":"During the solo music performance the strings were plucked by the workman.","Worse":"During the solo music performance the strings were plucked by the sculpture."},{"Item":2,"Better":"At the restaurant all the meals were cooked by the aboriginal.","Worse":"At the restaurant all the meals were cooked by the arrow."},{"Item":3,"Better":"The scientific research was funded by the traveller.","Worse":"The scientific research was funded by the suitcase."},{"Item":4,"Better":"Tenants were upset when housing prices were raised by the actress.","Worse":"Tenants were upset when housing prices were raised by the script."},{"Item":5,"Better":"After crying and waking up his parents the baby was breast-fed by his coach.","Worse":"After crying and waking up his parents the baby was breast-fed by his stadium."},{"Item":6,"Better":"At the baseball game, a ball was thrown by the suspect.","Worse":"At the baseball game, a ball was thrown by the passport."},{"Item":7,"Better":"The cure for the disease was discovered by the guest.","Worse":"The cure for the disease was discovered by the stamp."},{"Item":8,"Better":"At the theatre the programs were given by the controller.","Worse":"At the theatre the programs were given by the turbine."},{"Item":9,"Better":"At the wedding ceremony the ring was brought by the diabetic.","Worse":"At the wedding ceremony the ring was brought by the aspirin."},{"Item":10,"Better":"At the club the cocktails are served by the queen.","Worse":"At the club the cocktails are served by the dirt."},{"Item":11,"Better":"The rules of the game show were explained by the undertaker.","Worse":"The rules of the game show were explained by the tomb."},{"Item":12,"Better":"The next bus stop was announced by the drunkard.","Worse":"The next bus stop was announced by the tonic."},{"Item":13,"Better":"The child's dirty nappy was changed by his captive.","Worse":"The child's dirty nappy was changed by his cannon."},{"Item":14,"Better":"At the ballet, the music was played by the hypochondriac.","Worse":"At the ballet, the music was played by the medicine."},{"Item":15,"Better":"In ancient Egypt the people were governed by the baby.","Worse":"In ancient Egypt the people were governed by the mess."},{"Item":16,"Better":"The patient's aches and pains were examined by the candidate.","Worse":"The patient's aches and pains were examined by the microphone."},{"Item":17,"Better":"The rope was thrown by the graduate.","Worse":"The rope was thrown by the diploma."},{"Item":18,"Better":"The murder witness was cross-questioned by the freshman.","Worse":"The murder witness was cross-questioned by the chalk."},{"Item":19,"Better":"The violent demonstration was policed by the cleaner.","Worse":"The violent demonstration was policed by the turkey."},{"Item":20,"Better":"The cult's prophecies were established by the wrestler.","Worse":"The cult's prophecies were established by the trampoline."},{"Item":21,"Better":"While eating dinner with her parents, the woman was proposed to by her pupil.","Worse":"While eating dinner with her parents, the woman was proposed to by her pencil."},{"Item":22,"Better":"The studio recorded an album with music sung by the merchant.","Worse":"The studio recorded an album with music sung by the tear-gas."},{"Item":23,"Better":"The aeroplane was flown by the nurse.","Worse":"The aeroplane was flown by the anaesthesia."},{"Item":24,"Better":"The first lectures in college were given by the gangster.","Worse":"The first lectures in college were given by the shotgun."},{"Item":25,"Better":"The car's new features were marketed by the concierge.","Worse":"The car's new features were marketed by the fuse."},{"Item":26,"Better":"The husband got involved in an affair after having been seduced by his contestant.","Worse":"The husband got involved in an affair after having been seduced by his prize."},{"Item":27,"Better":"At UK pubs every drink is poured by the architect.","Worse":"At UK pubs every drink is poured by the crane."},{"Item":28,"Better":"At the hotel, luggage is delivered by the patient.","Worse":"At the hotel, luggage is delivered by the medication."},{"Item":29,"Better":"The clever boy was able to win the contest helped by his buyer.","Worse":"The clever boy was able to win the contest helped by his cutlery."},{"Item":30,"Better":"Thanks to the union talks, improved benefits were received by the model.","Worse":"Thanks to the union talks, improved benefits were received by the dress."},{"Item":31,"Better":"In the fairy-tale, the princess was rescued by the intern.","Worse":"In the fairy-tale, the princess was rescued by the artery."},{"Item":32,"Better":"The chaos in the classroom was initiated by the beginner.","Worse":"The chaos in the classroom was initiated by the belt."},{"Item":33,"Better":"Every day the rich Duke's soiled underwear was scrubbed by the principal.","Worse":"Every day the rich Duke's soiled underwear was scrubbed by the earlobe."},{"Item":34,"Better":"The pianist played his music while the bass was strummed by the diner.","Worse":"The pianist played his music while the bass was strummed by the plate."},{"Item":35,"Better":"During the exam, unacceptable cheating behaviour was exhibited by the admirer.","Worse":"During the exam, unacceptable cheating behaviour was exhibited by the candle."},{"Item":36,"Better":"Everyone sat around the campfire to hear a tale told by the viewer.","Worse":"Everyone sat around the campfire to hear a tale told by the camera."},{"Item":37,"Better":"At the pharmacy three bottles of insulin were sold by the striker.","Worse":"At the pharmacy three bottles of insulin were sold by the goalpost."},{"Item":38,"Better":"At the school, punishments for being late in class were given by the accomplice.","Worse":"At the school, punishments for being late in class were given by the handcuff."},{"Item":39,"Better":"After the meal was over the waitress was tipped by the speaker.","Worse":"After the meal was over the waitress was tipped by the television."},{"Item":40,"Better":"At the wedding the couple was married by the watcher.","Worse":"At the wedding the couple was married by the commercial."},{"Item":41,"Better":"The car was given a parking ticket by the explorer.","Worse":"The car was given a parking ticket by the ocean."},{"Item":42,"Better":"The film was recorded by the assassin.","Worse":"The film was recorded by the rifle."},{"Item":43,"Better":"During the basketball game hot dogs were sold by the schoolmaster.","Worse":"During the basketball game hot dogs were sold by the blackboard."},{"Item":44,"Better":"The man who stole the money was prosecuted by the receptionist.","Worse":"The man who stole the money was prosecuted by the headlight."},{"Item":45,"Better":"At the roller coaster in the amusement park, customers are counted by the journalist.","Worse":"At the roller coaster in the amusement park, customers are counted by the print."},{"Item":46,"Better":"The skin operation was performed by the parent.","Worse":"The skin operation was performed by the whistle."},{"Item":47,"Better":"At the track, the horse was raced by the applicant.","Worse":"At the track, the horse was raced by the curriculum."},{"Item":48,"Better":"The burglars were caught and arrested by the pianist.","Worse":"The burglars were caught and arrested by the metronome."},{"Item":49,"Better":"The castle was attacked by the shopper.","Worse":"The castle was attacked by the toffee."},{"Item":50,"Better":"In the court-case that attracted lots of media, the man was sentenced by the granny.","Worse":"In the court-case that attracted lots of media, the man was sentenced by the extinguisher."},{"Item":51,"Better":"Everyone watched while the man was mugged by the technician.","Worse":"Everyone watched while the man was mugged by the telescope."},{"Item":52,"Better":"At the sausage stand lots of food was bought by the villain.","Worse":"At the sausage stand lots of food was bought by the tower."},{"Item":53,"Better":"The decision to cancel the television show was made by the widow.","Worse":"The decision to cancel the television show was made by the coffin."},{"Item":54,"Better":"In the courtroom the killer was set free by the violinist.","Worse":"In the courtroom the killer was set free by the flute."},{"Item":55,"Better":"All possessions in the will were left by the reporter.","Worse":"All possessions in the will were left by the verdict."},{"Item":56,"Better":"In an act of generosity a large sum was donated by the sunbather.","Worse":"In an act of generosity a large sum was donated by the paddle."},{"Item":57,"Better":"The novel was written by the builder.","Worse":"The novel was written by the lawn-mower."},{"Item":58,"Better":"The holiday cruise ship was sailed by the president.","Worse":"The holiday cruise ship was sailed by the constitution."},{"Item":59,"Better":"At the church the baptism was conducted by the passenger.","Worse":"At the church the baptism was conducted by the deck."},{"Item":60,"Better":"Before the island was discovered, it was inhabited by the assistant.","Worse":"Before the island was discovered, it was inhabited by the tooth."},{"Item":61,"Better":"The ship was navigated by the toddler.","Worse":"The ship was navigated by the powder."},{"Item":62,"Better":"The bank's vault had been robbed by the psychologist.","Worse":"The bank's vault had been robbed by the tape-measure."},{"Item":63,"Better":"The advanced karate class was taught by the culprit.","Worse":"The advanced karate class was taught by the fingerprint."},{"Item":64,"Better":"Every day the school facilities were cleaned by the amateur.","Worse":"Every day the school facilities were cleaned by the boot."},{"Item":65,"Better":"Every morning at 6am the newspaper was delivered by the lookout.","Worse":"Every morning at 6am the newspaper was delivered by the aerosol."},{"Item":66,"Better":"The president was interviewed on television by the gambler.","Worse":"The president was interviewed on television by the harness."},{"Item":67,"Better":"At the children football game, a goal was scored by the delinquent.","Worse":"At the children football game, a goal was scored by the brake."},{"Item":68,"Better":"When there was a fire in the home everyone was carried out by the examiner.","Worse":"When there was a fire in the home everyone was carried out by the textbook."},{"Item":69,"Better":"During art lessons at kindergarten lots of messy pictures were created by the waiter.","Worse":"During art lessons at kindergarten lots of messy pictures were created by the parking-meter."},{"Item":70,"Better":"During a speech, the political rally was bombed by the bride.","Worse":"During a speech, the political rally was bombed by the ring."},{"Item":71,"Better":"Data from the drug trial was analysed by the engineer.","Worse":"Data from the drug trial was analysed by the brick."},{"Item":72,"Better":"The advanced mountain climbing lesson was given by the grocer.","Worse":"The advanced mountain climbing lesson was given by the shellfish."},{"Item":73,"Better":"The couple was afraid that their missing baby girl would be found by the spectator.","Worse":"The couple was afraid that their missing baby girl would be found by the mustard."},{"Item":74,"Better":"Before the funeral of the old man the grave was dug by the dean.","Worse":"Before the funeral of the old man the grave was dug by the catalogue."},{"Item":75,"Better":"Because of the recent threats the mayor was escorted by the sculptor.","Worse":"Because of the recent threats the mayor was escorted by the frame."},{"Item":76,"Better":"Because the car was parked illegally a ticket was issued by the trainee.","Worse":"Because the car was parked illegally a ticket was issued by the statement."},{"Item":77,"Better":"When the bottle leaked the milk was mopped up by the apprentice.","Worse":"When the bottle leaked the milk was mopped up by the sewing-machine."},{"Item":78,"Better":"At the estate sale, prices are announced by the rider.","Worse":"At the estate sale, prices are announced by the track."},{"Item":79,"Better":"Because of his ears, the student was targeted by the holiday-maker.","Worse":"Because of his ears, the student was targeted by the photograph."},{"Item":80,"Better":"A big crowd had gathered to watch as the rocket was launched by the caller.","Worse":"A big crowd had gathered to watch as the rocket was launched by the receiver."},{"Item":81,"Better":"The soup company for homeless people was funded by the plumber.","Worse":"The soup company for homeless people was funded by the keyhole."},{"Item":82,"Better":"During the election, the presidential candidate was voted for by his kid.","Worse":"During the election, the presidential candidate was voted for by his soap."},{"Item":83,"Better":"Despite the high security in the castle, the crown was stolen by the winner.","Worse":"Despite the high security in the castle, the crown was stolen by the golf-ball."},{"Item":84,"Better":"During the kidnapping, freedom was requested by the fan.","Worse":"During the kidnapping, freedom was requested by the bicycle."},{"Item":85,"Better":"The town was defended with guns by the bookworm.","Worse":"The town was defended with guns by the paperback."},{"Item":86,"Better":"At the sweet shop six pounds of candy was sold by the centurion.","Worse":"At the sweet shop six pounds of candy was sold by the sword."},{"Item":87,"Better":"The hole through the prison wall was drilled by the bachelor.","Worse":"The hole through the prison wall was drilled by the bouquet."},{"Item":88,"Better":"All the information for the test was memorised by the tourist.","Worse":"All the information for the test was memorised by the anchor."},{"Item":89,"Better":"Each month the rent payment was paid by the composer.","Worse":"Each month the rent payment was paid by the costume."},{"Item":90,"Better":"At the football match the winning goal was scored by the witch.","Worse":"At the football match the winning goal was scored by the crown."},{"Item":91,"Better":"At night the jail was locked by the character.","Worse":"At night the jail was locked by the magazine."},{"Item":92,"Better":"During the concert the symphony was conducted by the reverend.","Worse":"During the concert the symphony was conducted by the veil."},{"Item":93,"Better":"The phone call was redirected by the bidder.","Worse":"The phone call was redirected by the furniture."},{"Item":94,"Better":"During the athletic tournament, the runner was overtaken by the watchman.","Worse":"During the athletic tournament, the runner was overtaken by the jewellery."},{"Item":95,"Better":"Because of the recall everything was refunded by the cook.","Worse":"Because of the recall everything was refunded by the penny."},{"Item":96,"Better":"At the construction site all of the dirtiest work was done by the producer.","Worse":"At the construction site all of the dirtiest work was done by the keyboard."},{"Item":97,"Better":"Invitations to the dinner party were posted by the victim.","Worse":"Invitations to the dinner party were posted by the treasure."},{"Item":98,"Better":"At the airport, the luggage is searched by the boss.","Worse":"At the airport, the luggage is searched by the list."},{"Item":99,"Better":"In the Texan town the bank was robbed by the participant.","Worse":"In the Texan town the bank was robbed by the injection."},{"Item":100,"Better":"The employment interviews were administered by the servant.","Worse":"The employment interviews were administered by the tray."},{"Item":101,"Better":"The interesting story was written by the escort.","Worse":"The interesting story was written by the wine."},{"Item":102,"Better":"The taxi was driven by the dancer.","Worse":"The taxi was driven by the tutu."},{"Item":103,"Better":"At the golf game, a hole-in-one was scored by the landlord.","Worse":"At the golf game, a hole-in-one was scored by the lease."},{"Item":104,"Better":"At the pet hospital, dogs were cured by the soldier.","Worse":"At the pet hospital, dogs were cured by the uniform."},{"Item":105,"Better":"At the post office, letters are collected and delivered by the maniac.","Worse":"At the post office, letters are collected and delivered by the couch."},{"Item":106,"Better":"At the garage, the car maintenance is performed by the beggar.","Worse":"At the garage, the car maintenance is performed by the bowl."},{"Item":107,"Better":"At the hospital the complex heart surgery was performed by the slave.","Worse":"At the hospital the complex heart surgery was performed by the pyramid."},{"Item":108,"Better":"Upon arriving at the restaurant, the car was parked by the cameraman.","Worse":"Upon arriving at the restaurant, the car was parked by the monitor."},{"Item":109,"Better":"The circus performance was directed by the nun.","Worse":"The circus performance was directed by the oratory."},{"Item":110,"Better":"To keep visitors safe, the national park was patrolled by the repairer.","Worse":"To keep visitors safe, the national park was patrolled by the radiator."},{"Item":111,"Better":"At the library, the books are organised on the shelves by the king.","Worse":"At the library, the books are organised on the shelves by the throne."},{"Item":112,"Better":"At the bank, credit card requests are authorised by the restorer.","Worse":"At the bank, credit card requests are authorised by the spade."},{"Item":113,"Better":"Fish in the aquarium were studied by the musician.","Worse":"Fish in the aquarium were studied by the spotlight."},{"Item":114,"Better":"At the exhibition, all the pictures were taken by the protector.","Worse":"At the exhibition, all the pictures were taken by the protection."},{"Item":115,"Better":"At the graduation reception, the dinner was provided by the prisoner.","Worse":"At the graduation reception, the dinner was provided by the gate."},{"Item":116,"Better":"When the Italian diplomat gave a speech, the translation was performed by the driver.","Worse":"When the Italian diplomat gave a speech, the translation was performed by the windscreen."},{"Item":117,"Better":"The prescription for the mental disorder was written by the guard.","Worse":"The prescription for the mental disorder was written by the fence."},{"Item":118,"Better":"The bank robbery was prevented by the server.","Worse":"The bank robbery was prevented by the spoon."},{"Item":119,"Better":"The attacks on the ships were led by the trumpeter.","Worse":"The attacks on the ships were led by the violin."},{"Item":120,"Better":"At the opera concert in the theatre, the musical pieces were sung by the visitor.","Worse":"At the opera concert in the theatre, the musical pieces were sung by the cage."},{"Item":121,"Better":"Because his parents work all day, the baby was attended by the consumer.","Worse":"Because his parents work all day, the baby was attended by the package."},{"Item":122,"Better":"The dental restoration was performed by the Indian.","Worse":"The dental restoration was performed by the saddle."},{"Item":123,"Better":"At the Olympics, the bars competition was won by the cardinal.","Worse":"At the Olympics, the bars competition was won by the crucifix."},{"Item":124,"Better":"To lose weight, the woman's meal plan was prescribed by the hooligan.","Worse":"To lose weight, the woman's meal plan was prescribed by the banner."},{"Item":125,"Better":"The psychotherapy session was delivered by the teacher.","Worse":"The psychotherapy session was delivered by the table."},{"Item":126,"Better":"In the circus, the lions were tamed by the chemist.","Worse":"In the circus, the lions were tamed by the manuscript."},{"Item":127,"Better":"At the salon, the clients get her hair cut by the pedestrian.","Worse":"At the salon, the clients get her hair cut by the wheel."},{"Item":128,"Better":"At the museum, a tour and descriptions of the paintings were given by the kidnapper.","Worse":"At the museum, a tour and descriptions of the paintings were given by the extortion."},{"Item":129,"Better":"The safari excursion to Africa was led by the juggler.","Worse":"The safari excursion to Africa was led by the trapeze."},{"Item":130,"Better":"The corrupt tax fraud was discovered by the dad.","Worse":"The corrupt tax fraud was discovered by the dummy."},{"Item":131,"Better":"After the electricity outage, the apartment was checked by the observer.","Worse":"After the electricity outage, the apartment was checked by the wreckage."},{"Item":132,"Better":"After being locked, the door was repaired by the reader.","Worse":"After being locked, the door was repaired by the page."},{"Item":133,"Better":"In the theatre production, the villain was played by the recipient.","Worse":"In the theatre production, the villain was played by the checkbook."},{"Item":134,"Better":"The suit was adjusted by the shepherd.","Worse":"The suit was adjusted by the ice-pick."},{"Item":135,"Better":"At the farmers market, fresh fish is sold by the survivor.","Worse":"At the farmers market, fresh fish is sold by the grave."},{"Item":136,"Better":"The Tour de France was won by the bystander.","Worse":"The Tour de France was won by the wallet."},{"Item":137,"Better":"The book signing was attended by the famous camper.","Worse":"The book signing was attended by the famous sunlight."},{"Item":138,"Better":"The mountain summit was conquered by the audience.","Worse":"The mountain summit was conquered by the ticket."},{"Item":139,"Better":"The school walls were ruined with graffiti drawn by the client.","Worse":"The school walls were ruined with graffiti drawn by the engine."},{"Item":140,"Better":"On the lake, the boat race was won by the sheriff.","Worse":"On the lake, the boat race was won by the revolver."},{"Item":141,"Better":"The bush in the garden was trimmed by the opponent.","Worse":"The bush in the garden was trimmed by the challenge."},{"Item":142,"Better":"At the observatory, a new star was discovered by the criminal.","Worse":"At the observatory, a new star was discovered by the bench."},{"Item":143,"Better":"The card trick on the TV show was performed by the newborn.","Worse":"The card trick on the TV show was performed by the bib."},{"Item":144,"Better":"During Christmas dinner, gifts for the family were bought by the invader.","Worse":"During Christmas dinner, gifts for the family were bought by the weapon."},{"Item":145,"Better":"At the wedding on the church, the service was performed by the listener.","Worse":"At the wedding on the church, the service was performed by the log."},{"Item":146,"Better":"The destruction of the building was performed by the catcher.","Worse":"The destruction of the building was performed by the scoreboard."},{"Item":147,"Better":"At the monastery, a prayer was said by the owner.","Worse":"At the monastery, a prayer was said by the ambulance."},{"Item":148,"Better":"The Vatican has been ruled by the swimmer.","Worse":"The Vatican has been ruled by the seaweed."},{"Item":149,"Better":"During the protests, the shops were attacked by the child.","Worse":"During the protests, the shops were attacked by the desk."},{"Item":150,"Better":"At the restaurant, the plates are washed by the charlatan.","Worse":"At the restaurant, the plates are washed by the calculator."},{"Item":151,"Better":"The roman empire defences were attacked by the seller.","Worse":"The roman empire defences were attacked by the onion."},{"Item":152,"Better":"The stolen new car was raced through town by the schizophrenic.","Worse":"The stolen new car was raced through town by the pill."},{"Item":153,"Better":"The Nobel prize in literature was won by the murderer.","Worse":"The Nobel prize in literature was won by the bullet."},{"Item":154,"Better":"During the excavation, an ancient artefact was discovered by the user.","Worse":"During the excavation, an ancient artefact was discovered by the bell."}]