[{"Item":0,"Better":"The halftime show at the football match was organised by the cheerleader.","Worse":"The halftime show at the football match was organised by the striker."},{"Item":1,"Better":"During the solo music performance the strings were plucked by the harpist.","Worse":"During the solo music performance the strings were plucked by the trumpeter."},{"Item":2,"Better":"At the restaurant all the meals were cooked by the chef.","Worse":"At the restaurant all the meals were cooked by the diner."},{"Item":3,"Better":"The scientific research was funded by the sponsor.","Worse":"The scientific research was funded by the volunteer."},{"Item":4,"Better":"Tenants were upset when housing prices were raised by the proprietor.","Worse":"Tenants were upset when housing prices were raised by the occupant."},{"Item":5,"Better":"After crying and waking up his parents the baby was breast-fed by his mummy.","Worse":"After crying and waking up his parents the baby was breast-fed by his brother."},{"Item":6,"Better":"At the baseball game, a ball was thrown by the pitcher.","Worse":"At the baseball game, a ball was thrown by the catcher."},{"Item":7,"Better":"The cure for the disease was discovered by the doctor.","Worse":"The cure for the disease was discovered by the patient."},{"Item":8,"Better":"At the theatre the programs were given by the usher.","Worse":"At the theatre the programs were given by the audience."},{"Item":9,"Better":"At the wedding ceremony the ring was brought by the groom.","Worse":"At the wedding ceremony the ring was brought by the reverend."},{"Item":10,"Better":"At the club the cocktails are served by the barmaid.","Worse":"At the club the cocktails are served by the drunkard."},{"Item":11,"Better":"The rules of the game show were explained by the host.","Worse":"The rules of the game show were explained by the contestant."},{"Item":12,"Better":"The next bus stop was announced by the coachman.","Worse":"The next bus stop was announced by the user."},{"Item":13,"Better":"The child's dirty nappy was changed by his mum.","Worse":"The child's dirty nappy was changed by his toddler."},{"Item":14,"Better":"At the ballet, the music was played by the orchestra.","Worse":"At the ballet, the music was played by the dancer."},{"Item":15,"Better":"In ancient Egypt the people were governed by the Pharaoh.","Worse":"In ancient Egypt the people were governed by the slave."},{"Item":16,"Better":"The patient's aches and pains were examined by the physician.","Worse":"The patient's aches and pains were examined by the hypochondriac."},{"Item":17,"Better":"The rope was thrown by the cowboy.","Worse":"The rope was thrown by the Indian."},{"Item":18,"Better":"The murder witness was cross-questioned by the detective.","Worse":"The murder witness was cross-questioned by the convict."},{"Item":19,"Better":"The violent demonstration was policed by the policeman.","Worse":"The violent demonstration was policed by the hooligan."},{"Item":20,"Better":"The cult's prophecies were established by the prophet.","Worse":"The cult's prophecies were established by the admirer."},{"Item":21,"Better":"While eating dinner with her parents, the woman was proposed to by her boyfriend.","Worse":"While eating dinner with her parents, the woman was proposed to by her father."},{"Item":22,"Better":"The studio recorded an album with music sung by the vocalist.","Worse":"The studio recorded an album with music sung by the producer."},{"Item":23,"Better":"The aeroplane was flown by the pilot.","Worse":"The aeroplane was flown by the controller."},{"Item":24,"Better":"The first lectures in college were given by the lecturer.","Worse":"The first lectures in college were given by the freshman."},{"Item":25,"Better":"The car's new features were marketed by the saleswoman.","Worse":"The car's new features were marketed by the client."},{"Item":26,"Better":"The husband got involved in an affair after having been seduced by his mistress.","Worse":"The husband got involved in an affair after having been seduced by his wife."},{"Item":27,"Better":"At UK pubs every drink is poured by the barman.","Worse":"At UK pubs every drink is poured by the alcoholic."},{"Item":28,"Better":"At the hotel, luggage is delivered by the porter.","Worse":"At the hotel, luggage is delivered by the traveller."},{"Item":29,"Better":"The clever boy was able to win the contest helped by his mate.","Worse":"The clever boy was able to win the contest helped by his opponent."},{"Item":30,"Better":"Thanks to the union talks, improved benefits were received by the employee.","Worse":"Thanks to the union talks, improved benefits were received by the boss."},{"Item":31,"Better":"In the fairy-tale, the princess was rescued by the prince.","Worse":"In the fairy-tale, the princess was rescued by the witch."},{"Item":32,"Better":"The chaos in the classroom was initiated by the preschooler.","Worse":"The chaos in the classroom was initiated by the schoolmaster."},{"Item":33,"Better":"Every day the rich Duke's soiled underwear was scrubbed by the maid.","Worse":"Every day the rich Duke's soiled underwear was scrubbed by the queen."},{"Item":34,"Better":"The pianist played his music while the bass was strummed by the guitarist.","Worse":"The pianist played his music while the bass was strummed by the drummer."},{"Item":35,"Better":"During the exam, unacceptable cheating behaviour was exhibited by the student.","Worse":"During the exam, unacceptable cheating behaviour was exhibited by the professor."},{"Item":36,"Better":"Everyone sat around the campfire to hear a tale told by the storyteller.","Worse":"Everyone sat around the campfire to hear a tale told by the listener."},{"Item":37,"Better":"At the pharmacy three bottles of insulin were sold by the pharmacist.","Worse":"At the pharmacy three bottles of insulin were sold by the diabetic."},{"Item":38,"Better":"At the school, punishments for being late in class were given by the headmistress.","Worse":"At the school, punishments for being late in class were given by the child."},{"Item":39,"Better":"After the meal was over the waitress was tipped by the customer.","Worse":"After the meal was over the waitress was tipped by the cook."},{"Item":40,"Better":"At the wedding the couple was married by the pastor.","Worse":"At the wedding the couple was married by the bride."},{"Item":41,"Better":"The car was given a parking ticket by the traffic warden.","Worse":"The car was given a parking ticket by the delinquent."},{"Item":42,"Better":"The film was recorded by the director.","Worse":"The film was recorded by the actress."},{"Item":43,"Better":"During the basketball game hot dogs were sold by the vendor.","Worse":"During the basketball game hot dogs were sold by the spectator."},{"Item":44,"Better":"The man who stole the money was prosecuted by the lawyer.","Worse":"The man who stole the money was prosecuted by the witness."},{"Item":45,"Better":"At the roller coaster in the amusement park, customers are counted by the personnel.","Worse":"At the roller coaster in the amusement park, customers are counted by the rider."},{"Item":46,"Better":"The skin operation was performed by the dermatologist.","Worse":"The skin operation was performed by the nurse."},{"Item":47,"Better":"At the track, the horse was raced by the jockey.","Worse":"At the track, the horse was raced by the gambler."},{"Item":48,"Better":"The burglars were caught and arrested by the cop.","Worse":"The burglars were caught and arrested by the accomplice."},{"Item":49,"Better":"The castle was attacked by the enemy.","Worse":"The castle was attacked by the protector."},{"Item":50,"Better":"In the court-case that attracted lots of media, the man was sentenced by the judge.","Worse":"In the court-case that attracted lots of media, the man was sentenced by the reporter."},{"Item":51,"Better":"Everyone watched while the man was mugged by the attacker.","Worse":"Everyone watched while the man was mugged by the bystander."},{"Item":52,"Better":"At the sausage stand lots of food was bought by the eater.","Worse":"At the sausage stand lots of food was bought by the seller."},{"Item":53,"Better":"The decision to cancel the television show was made by the executive.","Worse":"The decision to cancel the television show was made by the watcher."},{"Item":54,"Better":"In the courtroom the killer was set free by the jury.","Worse":"In the courtroom the killer was set free by the murderer."},{"Item":55,"Better":"All possessions in the will were left by the deceased.","Worse":"All possessions in the will were left by the survivor."},{"Item":56,"Better":"In an act of generosity a large sum was donated by the millionaire.","Worse":"In an act of generosity a large sum was donated by the recipient."},{"Item":57,"Better":"The novel was written by the author.","Worse":"The novel was written by the reader."},{"Item":58,"Better":"The holiday cruise ship was sailed by the captain.","Worse":"The holiday cruise ship was sailed by the tourist."},{"Item":59,"Better":"At the church the baptism was conducted by the minister.","Worse":"At the church the baptism was conducted by the infant."},{"Item":60,"Better":"Before the island was discovered, it was inhabited by the native.","Worse":"Before the island was discovered, it was inhabited by the explorer."},{"Item":61,"Better":"The ship was navigated by the sailor.","Worse":"The ship was navigated by the passenger."},{"Item":62,"Better":"The bank's vault had been robbed by the burglar.","Worse":"The bank's vault had been robbed by the watchman."},{"Item":63,"Better":"The advanced karate class was taught by the master.","Worse":"The advanced karate class was taught by the beginner."},{"Item":64,"Better":"Every day the school facilities were cleaned by the janitor.","Worse":"Every day the school facilities were cleaned by the kid."},{"Item":65,"Better":"Every morning at 6am the newspaper was delivered by the newsboy.","Worse":"Every morning at 6am the newspaper was delivered by the journalist."},{"Item":66,"Better":"The president was interviewed on television by the correspondent.","Worse":"The president was interviewed on television by the viewer."},{"Item":67,"Better":"At the children football game, a goal was scored by the player.","Worse":"At the children football game, a goal was scored by the parent."},{"Item":68,"Better":"When there was a fire in the home everyone was carried out by the fireman.","Worse":"When there was a fire in the home everyone was carried out by the granny."},{"Item":69,"Better":"During art lessons at kindergarten lots of messy pictures were created by the youngster.","Worse":"During art lessons at kindergarten lots of messy pictures were created by the teacher."},{"Item":70,"Better":"During a speech, the political rally was bombed by the terrorist.","Worse":"During a speech, the political rally was bombed by the candidate."},{"Item":71,"Better":"Data from the drug trial was analysed by the scientist.","Worse":"Data from the drug trial was analysed by the participant."},{"Item":72,"Better":"The advanced mountain climbing lesson was given by the mountaineer.","Worse":"The advanced mountain climbing lesson was given by the amateur."},{"Item":73,"Better":"The couple was afraid that their missing baby girl would be found by the stranger.","Worse":"The couple was afraid that their missing baby girl would be found by the newborn."},{"Item":74,"Better":"Before the funeral of the old man the grave was dug by the digger.","Worse":"Before the funeral of the old man the grave was dug by the widow."},{"Item":75,"Better":"Because of the recent threats the mayor was escorted by the bodyguard.","Worse":"Because of the recent threats the mayor was escorted by the assassin."},{"Item":76,"Better":"Because the car was parked illegally a ticket was issued by the attendant.","Worse":"Because the car was parked illegally a ticket was issued by the driver."},{"Item":77,"Better":"When the bottle leaked the milk was mopped up by the mother.","Worse":"When the bottle leaked the milk was mopped up by the baby."},{"Item":78,"Better":"At the estate sale, prices are announced by the auctioneer.","Worse":"At the estate sale, prices are announced by the bidder."},{"Item":79,"Better":"Because of his ears, the student was targeted by the bully.","Worse":"Because of his ears, the student was targeted by the principal."},{"Item":80,"Better":"A big crowd had gathered to watch as the rocket was launched by the astronaut.","Worse":"A big crowd had gathered to watch as the rocket was launched by the onlooker."},{"Item":81,"Better":"The soup company for homeless people was funded by the entrepreneur.","Worse":"The soup company for homeless people was funded by the beggar."},{"Item":82,"Better":"During the election, the presidential candidate was voted for by his supporter.","Worse":"During the election, the presidential candidate was voted for by his rival."},{"Item":83,"Better":"Despite the high security in the castle, the crown was stolen by the thief.","Worse":"Despite the high security in the castle, the crown was stolen by the king."},{"Item":84,"Better":"During the kidnapping, freedom was requested by the hostage.","Worse":"During the kidnapping, freedom was requested by the kidnapper."},{"Item":85,"Better":"The town was defended with guns by the army.","Worse":"The town was defended with guns by the invader."},{"Item":86,"Better":"At the sweet shop six pounds of candy was sold by the shopkeeper.","Worse":"At the sweet shop six pounds of candy was sold by the shopper."},{"Item":87,"Better":"The hole through the prison wall was drilled by the fugitive.","Worse":"The hole through the prison wall was drilled by the guard."},{"Item":88,"Better":"All the information for the test was memorised by the scholar.","Worse":"All the information for the test was memorised by the examiner."},{"Item":89,"Better":"Each month the rent payment was paid by the tenant.","Worse":"Each month the rent payment was paid by the landlord."},{"Item":90,"Better":"At the football match the winning goal was scored by the defender.","Worse":"At the football match the winning goal was scored by the referee."},{"Item":91,"Better":"At night the jail was locked by the warden.","Worse":"At night the jail was locked by the prisoner."},{"Item":92,"Better":"During the concert the symphony was conducted by the maestro.","Worse":"During the concert the symphony was conducted by the violinist."},{"Item":93,"Better":"The phone call was redirected by the operator.","Worse":"The phone call was redirected by the caller."},{"Item":94,"Better":"During the athletic tournament, the runner was overtaken by the competitor.","Worse":"During the athletic tournament, the runner was overtaken by the coach."},{"Item":95,"Better":"Because of the recall everything was refunded by the manufacturer.","Worse":"Because of the recall everything was refunded by the consumer."},{"Item":96,"Better":"At the construction site all of the dirtiest work was done by the worker.","Worse":"At the construction site all of the dirtiest work was done by the engineer."},{"Item":97,"Better":"Invitations to the dinner party were posted by the hostess.","Worse":"Invitations to the dinner party were posted by the guest."},{"Item":98,"Better":"At the airport, the luggage is searched by the official.","Worse":"At the airport, the luggage is searched by the suspect."},{"Item":99,"Better":"In the Texan town the bank was robbed by the outlaw.","Worse":"In the Texan town the bank was robbed by the sheriff."},{"Item":100,"Better":"The employment interviews were administered by the committee.","Worse":"The employment interviews were administered by the applicant."},{"Item":101,"Better":"The interesting story was written by the writer.","Worse":"The interesting story was written by the character."},{"Item":102,"Better":"The taxi was driven by the cabdriver.","Worse":"The taxi was driven by the pedestrian."},{"Item":103,"Better":"At the golf game, a hole-in-one was scored by the golfer.","Worse":"At the golf game, a hole-in-one was scored by the umpire."},{"Item":104,"Better":"At the pet hospital, dogs were cured by the vet.","Worse":"At the pet hospital, dogs were cured by the owner."},{"Item":105,"Better":"At the post office, letters are collected and delivered by the postman.","Worse":"At the post office, letters are collected and delivered by the cashier."},{"Item":106,"Better":"At the garage, the car maintenance is performed by the mechanic.","Worse":"At the garage, the car maintenance is performed by the receptionist."},{"Item":107,"Better":"At the hospital the complex heart surgery was performed by the surgeon.","Worse":"At the hospital the complex heart surgery was performed by the intern."},{"Item":108,"Better":"Upon arriving at the restaurant, the car was parked by the chauffeur.","Worse":"Upon arriving at the restaurant, the car was parked by the waiter."},{"Item":109,"Better":"The circus performance was directed by the presenter.","Worse":"The circus performance was directed by the juggler."},{"Item":110,"Better":"To keep visitors safe, the national park was patrolled by the ranger.","Worse":"To keep visitors safe, the national park was patrolled by the camper."},{"Item":111,"Better":"At the library, the books are organised on the shelves by the librarian.","Worse":"At the library, the books are organised on the shelves by the dean."},{"Item":112,"Better":"At the bank, credit card requests are authorised by the manager.","Worse":"At the bank, credit card requests are authorised by the teller."},{"Item":113,"Better":"Fish in the aquarium were studied by the biologist.","Worse":"Fish in the aquarium were studied by the swimmer."},{"Item":114,"Better":"At the exhibition, all the pictures were taken by the photographer.","Worse":"At the exhibition, all the pictures were taken by the sculptor."},{"Item":115,"Better":"At the graduation reception, the dinner was provided by the caterer.","Worse":"At the graduation reception, the dinner was provided by the graduate."},{"Item":116,"Better":"When the Italian diplomat gave a speech, the translation was performed by the interpreter.","Worse":"When the Italian diplomat gave a speech, the translation was performed by the speaker."},{"Item":117,"Better":"The prescription for the mental disorder was written by the psychiatrist.","Worse":"The prescription for the mental disorder was written by the schizophrenic."},{"Item":118,"Better":"The bank robbery was prevented by the hero.","Worse":"The bank robbery was prevented by the gangster."},{"Item":119,"Better":"The attacks on the ships were led by the pirate.","Worse":"The attacks on the ships were led by the captive."},{"Item":120,"Better":"At the opera concert in the theatre, the musical pieces were sung by the tenor.","Worse":"At the opera concert in the theatre, the musical pieces were sung by the composer."},{"Item":121,"Better":"Because his parents work all day, the baby was attended by the nanny.","Worse":"Because his parents work all day, the baby was attended by the dad."},{"Item":122,"Better":"The dental restoration was performed by the dentist.","Worse":"The dental restoration was performed by the assistant."},{"Item":123,"Better":"At the Olympics, the bars competition was won by the gymnast.","Worse":"At the Olympics, the bars competition was won by the wrestler."},{"Item":124,"Better":"To lose weight, the woman's meal plan was prescribed by the dietician.","Worse":"To lose weight, the woman's meal plan was prescribed by the psychologist."},{"Item":125,"Better":"The psychotherapy session was delivered by the counsellor.","Worse":"The psychotherapy session was delivered by the maniac."},{"Item":126,"Better":"In the circus, the lions were tamed by the trainer.","Worse":"In the circus, the lions were tamed by the ballerina."},{"Item":127,"Better":"At the salon, the clients get her hair cut by the stylist.","Worse":"At the salon, the clients get her hair cut by the manicurist."},{"Item":128,"Better":"At the museum, a tour and descriptions of the paintings were given by the guide.","Worse":"At the museum, a tour and descriptions of the paintings were given by the workman."},{"Item":129,"Better":"The safari excursion to Africa was led by the adventurer.","Worse":"The safari excursion to Africa was led by the holiday-maker."},{"Item":130,"Better":"The corrupt tax fraud was discovered by the accountant.","Worse":"The corrupt tax fraud was discovered by the charlatan."},{"Item":131,"Better":"After the electricity outage, the apartment was checked by the electrician.","Worse":"After the electricity outage, the apartment was checked by the concierge."},{"Item":132,"Better":"After being locked, the door was repaired by the repairman.","Worse":"After being locked, the door was repaired by the plumber."},{"Item":133,"Better":"In the theatre production, the villain was played by the actor.","Worse":"In the theatre production, the villain was played by the musician."},{"Item":134,"Better":"The suit was adjusted by the tailor.","Worse":"The suit was adjusted by the apprentice."},{"Item":135,"Better":"At the farmers market, fresh fish is sold by the fisherman.","Worse":"At the farmers market, fresh fish is sold by the grocer."},{"Item":136,"Better":"The Tour de France was won by the cyclist.","Worse":"The Tour de France was won by the fan."},{"Item":137,"Better":"The book signing was attended by the famous novelist.","Worse":"The book signing was attended by the famous bookworm."},{"Item":138,"Better":"The mountain summit was conquered by the climber.","Worse":"The mountain summit was conquered by the shepherd."},{"Item":139,"Better":"The school walls were ruined with graffiti drawn by the vandal.","Worse":"The school walls were ruined with graffiti drawn by the lookout."},{"Item":140,"Better":"On the lake, the boat race was won by the rower.","Worse":"On the lake, the boat race was won by the sunbather."},{"Item":141,"Better":"The bush in the garden was trimmed by the gardener.","Worse":"The bush in the garden was trimmed by the builder."},{"Item":142,"Better":"At the observatory, a new star was discovered by the astronomer.","Worse":"At the observatory, a new star was discovered by the technician."},{"Item":143,"Better":"The card trick on the TV show was performed by the magician.","Worse":"The card trick on the TV show was performed by the cameraman."},{"Item":144,"Better":"During Christmas dinner, gifts for the family were bought by the grandma.","Worse":"During Christmas dinner, gifts for the family were bought by the cleaner."},{"Item":145,"Better":"At the wedding on the church, the service was performed by the cleric.","Worse":"At the wedding on the church, the service was performed by the bachelor."},{"Item":146,"Better":"The destruction of the building was performed by the wrecker.","Worse":"The destruction of the building was performed by the architect."},{"Item":147,"Better":"At the monastery, a prayer was said by the monk.","Worse":"At the monastery, a prayer was said by the nun."},{"Item":148,"Better":"The Vatican has been ruled by the pope.","Worse":"The Vatican has been ruled by the cardinal."},{"Item":149,"Better":"During the protests, the shops were attacked by the agitator.","Worse":"During the protests, the shops were attacked by the merchant."},{"Item":150,"Better":"At the restaurant, the plates are washed by the washer.","Worse":"At the restaurant, the plates are washed by the server."},{"Item":151,"Better":"The roman empire defences were attacked by the barbarian.","Worse":"The roman empire defences were attacked by the centurion."},{"Item":152,"Better":"The stolen new car was raced through town by the robber.","Worse":"The stolen new car was raced through town by the repairer."},{"Item":153,"Better":"The Nobel prize in literature was won by the poet.","Worse":"The Nobel prize in literature was won by the chemist."},{"Item":154,"Better":"During the excavation, an ancient artefact was discovered by the archaeologist.","Worse":"During the excavation, an ancient artefact was discovered by the restorer."}]