[{"Item":0,"Better":"在这个作家把这本小说读完了之后，太阳就开始下山了。","Worse":"在这个作家把这本小说剪伤了之后，太阳就开始下山了。"},{"Item":1,"Better":"在这只小白兔把那块红萝卜吃光了之后，有 一阵风吹过。","Worse":"在这只小白兔把那块红萝卜迷住了之后，有 一阵风吹过。"},{"Item":2,"Better":"在这个画家把这幅自画像挂起了之后，客人就到访了。","Worse":"在这个画家把这幅自画像治愈了之后，客人就到访了。"},{"Item":3,"Better":"在这只猫儿把这个鱼缸打翻了之后，主人就回来了。","Worse":"在这只猫儿把这个鱼缸气死了之后，主人就回来了。"},{"Item":4,"Better":"在那位病人把这种新药物服错了之后，医生就很担心了。","Worse":"在那位病人把这种新药物捧红了之后，医生 就很担心了。"},{"Item":5,"Better":"在那位模特儿把那一头白发染黑了之后，陈老板就很高兴了。","Worse":"在那位模特儿把那一头白发绊倒了之后，陈老板就很高兴了。"},{"Item":6,"Better":"在那个小孩把这个玩具丢失了之后，妈妈就生气了。","Worse":"在那个小孩把这个玩具难倒了之后，妈妈就生气了。"},{"Item":7,"Better":"在这位科学家把新的理论推翻了之后，大家都争相访问他。","Worse":"在这位科学家把新的理论弄伤了之后，大家都争相访问他。"},{"Item":8,"Better":"在这位专家把这个危机化解了之后，大家都很佩服他。","Worse":"在这位专家把这个危机满足了之后，大家都很佩服他。"},{"Item":9,"Better":"在高材生把数学题解答了之后，老师感到很高兴。","Worse":"在高材生把数学题困住了之后，老师感到很高兴。"},{"Item":10,"Better":"在那个技工把这台机器修好了之后，老板十分满意。","Worse":"在那个技工把这台机器害苦了之后，老板十分满意。"},{"Item":11,"Better":"在收藏家把这帧照片挂起了之后，地震就发生了。","Worse":"在收藏家把这帧照片压伤了之后，地震就发生了。"},{"Item":12,"Better":"在那位市民把家居火警扑灭了之后，就开始下大雨了。","Worse":"在那位市民把家居火警蒙蔽了之后，就开始下大雨了。"},{"Item":13,"Better":"在特务把这项任务完成了之后，战争就结束了。","Worse":"在特务把这项任务关上了之后，战争就结束了。"},{"Item":14,"Better":"在那个邮差把包裹送出了之后，车祸就发生了。","Worse":"在那个邮差把包裹气死了之后，车祸就发生了。"},{"Item":15,"Better":"在海盗把宝藏奪去了之后，那艘船就翻了。","Worse":"在海盗把宝藏害惨了之后，那艘船就翻了。"},{"Item":16,"Better":"在那个囚犯把那个手扣破坏了之后，陈警长就发怒了。","Worse":"在那个囚犯把那个手扣压伤了之后，陈警长就发怒了。"},{"Item":17,"Better":"在那个议员把这份提案否决了之后，总统就来到了。","Worse":"在那个议员把这份提案毒死了之后，总统就来到了。"},{"Item":18,"Better":"在这只大象把池塘里的水喝光了之后，其他动物就离开了。","Worse":"在这只大象把池塘里的水逗乐了之后，其他动物就离开了。"},{"Item":19,"Better":"在商人把商品售出了之后，田老板就高兴了。","Worse":"在商人把商品迷倒了之后，田老板就高兴了。"},{"Item":20,"Better":"在那搬运工人把这些货物运走了之后，天色就变坏了。","Worse":"在那搬运工人把这些货物平定了之后，天色就变坏了。"},{"Item":21,"Better":"在这个摄影师把这里的风景拍下了之后，天色就开始变坏了。","Worse":"在这个摄影师把这里的风景蒙蔽了之后，天色就开始变坏了。"},{"Item":22,"Better":"在那群暴徒把这辆坦克车烧着了之后，军队就来到了。","Worse":"在那群暴徒把这辆坦克车缠住了之后，军队就来到了。"},{"Item":23,"Better":"在这个收藏家把这件古董购下了之后，恶霸就现身了。","Worse":"在这个收藏家把这件古董累坏了之后，恶霸就现身了。"},{"Item":24,"Better":"在这群赌徒把那笔钱输光了之后，高利贷集团就乘虚而入了。","Worse":"在这群赌徒把那笔钱送走了之后，高利贷集团就乘虚而入了。"},{"Item":25,"Better":"在这些参赛者把游戏规则背熟了之后，比赛就要开始了。","Worse":"在这些参赛者把游戏规则绊倒了之后，比赛就要开始了。"},{"Item":26,"Better":"在那家庭主妇把这些家务做完了之后，弟弟就打翻了颜料。","Worse":"在那家庭主妇把这些家务撞伤了之后，弟弟就打翻了颜料。"},{"Item":27,"Better":"在那位太空人把这支火箭检查了之后，工程师就放心了。","Worse":"在那位太空人把这支火箭打动了之后，工程师就放心了。"},{"Item":28,"Better":"在那个青年把这批毒品藏起了之后，警察就来到了。","Worse":"在那个青年把这批毒品滑倒了之后，警察就来到了。"},{"Item":29,"Better":"在那个推销员把这辆房車售出了之后，天色就开始昏暗了。","Worse":"在那个推销员把这辆房車害惨了之后，天色就开始昏暗了。"},{"Item":30,"Better":"在这个运动员把这啦啦队歌听熟了之后，比赛就结束了。","Worse":"在这个运动员把这啦啦队歌推倒了之后，比赛就结束了。"},{"Item":31,"Better":"在这清洁女工把湿滑的地面擦乾了之后，天上就开始下雨了。","Worse":"在这清洁女工把湿滑的地面逗乐了之后，天上就开始下雨了。"},{"Item":32,"Better":"在这位投资者把那些股票售出了之后，股市就开始上扬了。","Worse":"在这位投资者把那些股票卷走了之后，股市就开始上扬了。"},{"Item":33,"Better":"在那个官员把选举结果篡改了之后，总统就被暗杀了。","Worse":"在那个官员把选举结果压倒了之后，总统就被暗杀了。"},{"Item":34,"Better":"在那个小孩把那小石块踢开了之后，小狗就跑过来了。","Worse":"在那个小孩把那小石块闷坏了之后，小狗就跑过来了。"},{"Item":35,"Better":"在滑浪者把大浪克服了之后，众人就大叫起来。","Worse":"在滑浪者把大浪感动了之后，众人就大叫起来。"},{"Item":36,"Better":"在举重选手把哑铃举起了之后，大家都很震惊。","Worse":"在举重选手把哑铃保护了之后，大家都很震惊。"},{"Item":37,"Better":"在影评人把那文艺片批评了之后，大家都很失望。","Worse":"在影评人把那文艺片指证了之后，大家都很失望。"},{"Item":38,"Better":"在那个牧师把这圣经故事讲解了之后，音乐就响起来了。","Worse":"在那个牧师把这圣经故事炸死了之后，音乐就响起来了。"},{"Item":39,"Better":"在那冲锋队员把避弹衣穿好了之后，敌人就来袭了。","Worse":"在那冲锋队员把避弹衣刺伤了之后，敌人就来袭了。"},{"Item":40,"Better":"在这个罪犯把那些证据销毁了之后，证人就消失了。","Worse":"在这个罪犯把那些证据闷坏了之后，证人就消失了。"},{"Item":41,"Better":"在这位运动员把世界纪录打破了之后，欢众在不断地喝彩了。","Worse":"在这位运动员把世界纪录滋润了之后，欢众在不断地喝彩了。"},{"Item":42,"Better":"在恐怖分子把炸弹引爆了之后，警方就展开调查。","Worse":"在恐怖分子把炸弹浮起了之后，警方就展开调查。"},{"Item":43,"Better":"在那个武侠把那把宝剑打断了之后，众人都吃了一惊。","Worse":"在那个武侠把那把宝剑迷倒了之后，众人都吃了一惊。"},{"Item":44,"Better":"在陈导演把那出电影剪辑了之后，天就快亮了。","Worse":"在陈导演把那出电影保护了之后，天就快亮了。"},{"Item":45,"Better":"在那个习泳者把浮板抱紧了之后，海浪就开始大了。","Worse":"在那个习泳者把浮板揭发了之后，海浪就开始大了。"},{"Item":46,"Better":"在裁缝把剪刀收好了之后，客人就离开了。","Worse":"在裁缝把剪刀难倒了之后，客人就离开了。"},{"Item":47,"Better":"在赛车手把安全带繫上了之后，车祸就发生了。","Worse":"在赛车手把安全带砸伤了之后，车祸就发生了。"},{"Item":48,"Better":"在这个奸商把那份文件销毀了之后，形势就扭转了。","Worse":"在这个奸商把那份文件害惨了之后，形势就扭转了。"},{"Item":49,"Better":"在那些工人把这块大石搬走了之后，天上就开始下雨了。","Worse":"在那些工人把这块大石改变了之后，天上就开始下雨了。"},{"Item":50,"Better":"在障碍赛选手把这个栏跨过了之后，评判就站起来了。","Worse":"在障碍赛选手把这个栏烧伤了之后，评判就站起来了。"},{"Item":51,"Better":"在飞行表演员把降落伞打开了之后，观众就欢呼起来了。","Worse":"在飞行表演员把降落伞弄脏了之后，观众就欢呼起来了。"},{"Item":52,"Better":"在那退伍军人把战争的经历忘却了之后，老太太就开始生病了。","Worse":"在那退伍军人把战争的经历弄湿了之后，老太太就开始生病了。"},{"Item":53,"Better":"在那个消防员把这场火扑灭了之后，大家都在欢呼。","Worse":"在那个消防员把这场火出卖了之后，大家都在欢呼。"},{"Item":54,"Better":"在那个小孩把这些颜料弄混了之后，老师就生气了。","Worse":"在那个小孩把这些颜料吓坏了之后，老师就生气了。"},{"Item":55,"Better":"在王小姐把雨水擦乾了之后，太阳就出来了。","Worse":"在王小姐把雨水感动了之后，太阳就出来了。"},{"Item":56,"Better":"在这个卧底把那个窃听器装好了之后，行动就取消了。","Worse":"在这个卧底把那个窃听器喂饱了之后，行动就取消了。"},{"Item":57,"Better":"在这头小狗把那块肉吃掉了之后，主人就回家了。","Worse":"在这头小狗把那块肉吓坏了之后，主人就回家了。"}]